{
  "main": {
    "name": "Yi Zu",
    "occupation": "Software Engineer",
    "description": "I have a passion for building social impact technologies and consumer products that have an influence on people's lifestyles. Determined, organized, team oriented, multicultural and enthusiastic. I love learning visually and kinesthetically to gain depth of knowledge in the work place. In my free time, I love staying fit, boxing, surfing, soccer and traveling the world",
    "image": "profilepic.jpg",
    "bio": "Growing up in Italy from a Chinese family, I love embracing diversity and different cultures in my personal and professional life. I enjoy building social impact products in the fitness and education space to empower youth in the world. I enjoying building applications with React, TypeScript/JavaScript and Python.",
    "contactmessage": "Looking to for junior software jobs/internships. Contact me if you see a fit with my personality and work experience.",
    "email": "yi.zu@hotmail.com",
    "phone": "Contact me via email",
    "address": {
      "city": "Boston",
      "state": "MA",
      "zip": "02219"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "https://drive.google.com/file/d/1nfpIpPOPBhyAg_Bu_Qn2TGAdfNzLUK3h/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/yizu/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/yizucodes/",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "These are the technologies that I love to tinker and build awesome stuff",
    "education": [
      {
        "school": "Northeastern University",
        "degree": "M.S. Computer Science",
        "graduated": "Sept. 2022 - Current"
      },
      {
        "school": "University of California, San Diego",
        "degree": "University & Professional Studies Program",
        "graduated": "Sept. 2018 - June 2019",
        "description": "Relevant coursework: Introduction to Programming in Java, HTML5 & CSS & JavaScript, Human-Computer Interaction Programming Studio, Interaction Design, Linear Algebra"
      },
      {
        "school": "Boston University",
        "degree": "B.A. Economics, B.S.B.A. Concentration in Strategy and Innovation",
        "graduated": "May 2017"
      }
    ],
    "work": [
      {
      "company": "CarGurus",
      "title": "Software Engineer Co-op",
      "years": "Jan. 2024 - June 2024",
      "description": "• Collaborated cross-functionally with product managers, engineering managers, frontend and backend engineers, and designers in a 10-person team to develop vehicle detail and post-lead pages for a multi-platform web application\n• Contributed to the marketing vehicle detail page using React and TypeScript by standardizing the codebase for consistency and readability, increasing developer productivity, merging 13 pull requests, and adding 600+ lines of code\n• Migrated 10 legacy user interface components to a custom Radix UI library in a codebase 50,000+ lines of code, enhancing modularity and scalability while reducing technical debt, complexity, and bugs, resulting in improved developer productivity\n• Implemented A/B testing framework using Java, React and TypeScript to evaluate performance of current user interface and investigate improvements based on conversion rate and core web vitals resulting in valuable insights for future optimizations\n• Engineered comprehensive unit tests with Jest and React Testing Library, achieving 90%+ coverage while enhancing code documentation, application stability, and overall codebase reliability"
      },
      {
        "company": "E.R.WEB",
        "title": "Frontend Developer",
        "years": "May 2023 - Aug. 2023",
        "description": "• Integrated age and identity verification system with React Native and JavaScript reducing the average registration time by 50%\n• Optimized story highlights feature using JavaScript increasing user impressions of product instructions by 12%\n• Refactored a device location feature to bolster user experience improving customer retention by 19%"
      },
      {
        "company": "Blue Reply",
        "title": "Frontend Developer",
        "years": "June 2021 - Aug. 2022",
        "description": "Project: Whirlpool Analytics for Consumer Websites\n• Translated business requirements into technical requirements to support sprint planning activities\n• Identified risks and dependencies of technical specifications to inform stakeholders about trade-offs in performance\n• Trained new developers about analytics best practices to increase their knowledge and productivity with their respective teams\n\nProject: E-commerce Proof of Concept\n• Researched and presented slides about the Chinese e-commerce market leading to an international clothing brand sales lead\n• Researched internationalization and state management best practices to identify trade-offs in performance and scalability\n• Presented proof of concept e-commerce application to technical team leaders and developers to showcase the feasibility of migrating current e-commerce application to another frontend framework\n\nProject: Luxottica E-commerce Platform\n• Integrated user and retail store data to the user interface allowing client to manage privileges and view reports\n• Refactored legacy codebase of international eyewear company's e-commerce platform to improve performance and scalability\n• Created a feature allowing eyewear customers to input additional shopper information and gather shopping preferences"
      },
      {
        "company": "Self-employed",
        "title": "Freelance Web Developer",
        "years": "Feb. 2021 - May 2021",
        "description":  "• Develop website based on design and client requirements to increase brand awareness and course registrations\n• Integrate content management system with website allowing client to independently add or modify website content"
      },
      {
        "company": "Coderbunker",
        "title": "Freelance Web Developer",
        "years": "Aug. 2020 - Jan. 2021",
        "description": "• Develop responsive login and error page interface based on design and product requirements for customer’s retail clients \n• Create custom components and user interface for customer’s dashboard to track retail shop’s use of the music player \n• Integrate custom components to build a responsive music player for desktop and tablet \n• Build announcement table feature to integrate retail store announcements with music player"
      },
      {
        "company": "Golf AI",
        "title": "Web Development Intern",
        "years": "June 2019 - July 2019",
        "description": "• Conduct user research interviews to understand user needs and prioritize features to be built in mobile application \n• Create company website to inform users about the company, increase app downloads and traffic to social media accounts"
      },
      {
        "company": "New Alchemy",
        "title": "Data Researcher",
        "years": "July 2017 – July 2018",
        "description": "• Wrote web-scraping scripts using Python to collect data from EDGAR forms for analyzing trends in security offering \n• Mapped company database to match other listing site’s data structure reducing the time to find new crypto projects by 45%"
      }
    ],
    "skills": [
      {
        "name": "HTML",
        "description": "Used at the start of my front-end development journey to build websites.",
        "image": "htmlImage.png"
      },
      {
        "name": "CSS",
        "description": "Used in combination with HTML and JS at the start of my front-end development journey.",
        "image": "cssImage.png"
      },
      {
        "name": "JavaScript",
        "description": "Most of the frontend projects built included JavaScript. Also learnt jQuery at UC San Diego.",
        "image": "javascriptImage.png"
      },
      {
        "name": "TypeScript",
        "description": "Used at Coderbunker and during work experience at Reply. Enjoying the type safety!",
        "image": "typescript.png"
      },
      {
        "name": "React",
        "description": "Preferred web framework used for professional and personal projects.",
        "image": "reactImage.png"
      },
            {
        "name": "Redux",
        "description": "State management library used to build enterprise applications.",
        "image": "redux.png"
      },
      {
        "name": "Material-UI",
        "description": "Preferred library of choice for quickly building responsive websites.",
        "image": "materialUI.png"
      },
      {
        "name": "Python",
        "description": "First programming language learned and used to create a webscraping script at New Alchemy.",
        "image": "pythonImage.png"
      },
      {
        "name": "Java",
        "description": "Used for introductory programming courses at UC San Diego and object-oriented design class at Northeastern University.",
        "image": "javaImage.png"
      },
      {
        "name": "Node JS",
        "description": "Preferred server-side scripting langauge. Used in combination with REST APIs.",
        "image": "nodeImage.png"
      },
      {
        "name": "MongoDB",
        "description": "Document database mostly used for small applicatons and hackathons.",
        "image": "mongoImage.png"
      },
      {
        "name": "Git",
        "description": "Preferred version control system. Used in professional and personal setting.",
        "image": "gitIcon.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "CarGurus Marketing VDP",
        "category": "See more feature for car grid in marketing vehicle page",
        "image": "carGurus.jpg",
        "url": "https://www.loom.com/share/cbf41ea98f364620a054799a95a2f0b3"
      },
      {
        "title": "Readit",
        "category": "Readit is a social news and discussion application runnable on the command line interface",
        "image": "reddit.png",
        "url": "https://github.com/yizucodes/readit"
      },
      {
        "title": "physyou",
        "category": "physyou is a telehealth platform for physical therapists to prescribe exercises and monitor a patient's performance",
        "image": "physyou.png",
        "url": "https://devpost.com/software/physyou"
      },
      {
        "title": "Smart Social",
        "category": "Instagram scheduler integration with Monday apps platform to automate posts on Instagram business profiles",
        "image": "smart-social.svg",
        "url": "https://devpost.com/software/smart-social-instagram-post-scheduling-integration"
      },
      {
        "title": "Lemon",
        "category": "Food supply chain management platform for grocery stores",
        "image": "lemonhacksc.png",
        "url": "https://lemonhacksc.herokuapp.com/"
      },
      {
        "title": "VeriFood",
        "category": "Identity Verification System for Homeless People to Access Digital Food Stamps",
        "image": "verifoodHome.png",
        "url": "https://github.com/yizucodes/Verifood-AngelHack"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
