{
  "main": {
    "name": "Yi Zu",
    "occupation": "Web Developer",
    "description": "I have a passion for building social impact technologies and consumer products that have an influence on people's lifestyles. Determined, organized, team oriented, multicultural and enthusiastic. I love learning visually and kinesthetically to gain depth of knowledge in the work place. In my free time, I love staying fit, boxing, surfing, soccer and traveling the world",
    "image": "profilepic.jpg",
    "bio": "Growing up in Italy from a Chinese family, I love embracing diversity and different cultures in my personal and professional life. I Love building social impact products in the fitness and education space to empower youth in the world. I specialize in building user interfaces in JavaScript, HTML, CSS and React.",
    "contactmessage": "Looking to for junior software jobs/internships. Contact me if you see a fit with my personality and work experience.",
    "email": "yi.zu@hotmail.com",
    "phone": "Contact me via email",
    "address": {
      "city": "Boston",
      "state": "MA",
      "zip": "02219"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "https://drive.google.com/file/d/1kN_o0Je-xPmiMa2x_e8iVaR7gTxbailc/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/yizu/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/yizucodes/",
        "className": "fa fa-instagram"
      },
      {
      "name": "twitter",
      "url": "https://twitter.com/yizucodes",
      "className": "fa fa-twitter"
      },
      {
        "name": "github",
        "url": "https://github.com/yizucodes/",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "These are the technologies that I love to tinker and build awesome stuff",
    "education": [
      {
        "school": "Northeastern University",
        "degree": "M.S. Computer Science",
        "graduated": "Sept. 2022 - Current"
      },
      {
        "school": "University of California, San Diego",
        "degree": "University & Professional Studies Program",
        "graduated": "Sept. 2018 - June 2019",
        "description": "Relevant coursework: Introduction to Programming in Java, HTML5 & CSS & JavaScript, Human-Computer Interaction Programming Studio, Interaction Design, Linear Algebra"
      },
      {
        "school": "Boston University",
        "degree": "B.A. Economics, B.S.B.A. Concentration in Strategy and Innovation",
        "graduated": "May 2017"
      }
    ],
    "work": [
      {
        "company": "E.R.WEB",
        "title": "Frontend Developer",
        "years": "May 2023 - Current",
        "description": "• Implement error handling for user authentication to enhance security and streamline user flow \n • Integrate external data sources to enhance user experience and web application’s functionality"
      },
      {
        "company": "Blue Reply",
        "title": "Frontend Developer",
        "years": "June 2021 - Aug. 2022",
        "description": "• Integrate user and retail store data to the user interface allowing client to manage privileges and view reports \n • Refactor legacy codebase of international eyewear company’s e-commerce platform to improve performance and scalability \n• Create feature allowing eyewear customer to input additional shopper information and gather shopping preferences"
      },
      {
        "company": "Self-employed",
        "title": "Freelance Web Developer",
        "years": "Feb. 2021 - May 2021",
        "description":  "• Develop website based on design and client requirements to increase brand awareness and course registrations\n• Integrate content management system with website allowing client to independently add or modify website content"
      },
      {
        "company": "Coderbunker",
        "title": "Freelance Web Developer",
        "years": "Aug. 2020 - Jan. 2021",
        "description": "• Develop responsive login and error page interface based on design and product requirements for customer’s retail clients \n• Create custom components and user interface for customer’s dashboard to track retail shop’s use of the music player \n• Integrate custom components to build a responsive music player for desktop and tablet \n• Build announcement table feature to integrate retail store announcements with music player"
      },
      {
        "company": "Golf AI",
        "title": "Web Development Intern",
        "years": "June 2019 - July 2019",
        "description": "• Conduct user research interviews to understand user needs and prioritize features to be built in mobile application \n• Create company website to inform users about the company, increase app downloads and traffic to social media accounts"
      },
      {
        "company": "New Alchemy",
        "title": "Data Researcher",
        "years": "July 2017 – July 2018",
        "description": "• Wrote web-scraping scripts using Python to collect data from EDGAR forms for analyzing trends in security offering \n• Mapped company database to match other listing site’s data structure reducing the time to find new crypto projects by 45%"
      }
    ],
    "skills": [
      {
        "name": "HTML",
        "description": "Used at the start of my front-end development journey to build websites.",
        "image": "htmlImage.png"
      },
      {
        "name": "CSS",
        "description": "Used in combination with HTML and JS at the start of my front-end development journey.",
        "image": "cssImage.png"
      },
      {
        "name": "JavaScript",
        "description": "All of the frontend projects built included JavaScript. Also learnt jQuery at UC San Diego.",
        "image": "javascriptImage.png"
      },
      {
        "name": "TypeScript",
        "description": "Used for freelance project at Coderbunker and continuously monitoring growth of this language.",
        "image": "typescript.png"
      },
      {
        "name": "React",
        "description": "Preferred web framework used for professional and personal projects.",
        "image": "reactImage.png"
      },
            {
        "name": "Redux",
        "description": "State management library used to build enterprise applications.",
        "image": "redux.png"
      },
      {
        "name": "Material-UI",
        "description": "Preferred library of choice for quickly building responsive websites.",
        "image": "materialUI.png"
      },
      {
        "name": "Python",
        "description": "First programming language learned and used to create a webscraping script at New Alchemy.",
        "image": "pythonImage.png"
      },
      {
        "name": "Node JS",
        "description": "Preferred server-side scripting langauge. Used in combination with REST APIs.",
        "image": "nodeImage.png"
      },
      {
        "name": "MongoDB",
        "description": "Document database mostly used for small applicatons and hackathons.",
        "image": "mongoImage.png"
      },
      {
        "name": "Git",
        "description": "Preferred version control system. Used in professional and personal setting.",
        "image": "gitIcon.png"
      },
      {
        "name": "Heroku",
        "description": "Preferred hosting and deployment platform because of its easy integration with Github.",
        "image": "herokuImage.png"
      }
    ]
  },
  "portfolio": {
    "projects": [
            {
        "title": "physyou",
        "category": "physyou is a telehealth platform for physical therapists to prescribe exercises and monitor a patient's performance",
        "image": "physyou.png",
        "url": "https://devpost.com/software/physyou"
      },
      {
        "title": "Lemon",
        "category": "Food supply chain management platform for grocery stores",
        "image": "lemonhacksc.png",
        "url": "https://lemonhacksc.herokuapp.com/"
      },
      {
        "title": "Soccer Without Borders",
        "category": "Soccer video showcase website for underpriviledge teenagers",
        "image": "SWB_ScreenShot.png",
        "url": "https://soccerwithoutborders.herokuapp.com/"
      },
      {
        "title": "VeriFood",
        "category": "Identity Verification System for Homeless People to Access Digital Food Stamps",
        "image": "verifoodHome.png",
        "url": "https://github.com/yizucodes/Verifood-AngelHack"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Kareem Abdul Jabbar"
      },
      {
        "text": "That Tim Baker must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, he may be fresh out of University and have zero on the job experience but I am confident that he will be one of your best developers in no time!",
        "user": "Steve Wozniak... impersonator"
      }
    ]
  }
}
